mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <license>License/CMSIS_END_USER_LICENSE_AGREEMENT.txt</license> 
  <vendor>Infineon</vendor>
  <url>https://www.infineon.com/cmsis_packs/XMC4000/</url>
  <name>XMC4000_DFP</name>
  <description>
      Infineon XMC4000 Series Device Support, Drivers and Examples
  </description>
  <supportContact>http://www.infineon.com/cms/en/corporate/company/contact/support/index.html</supportContact> 
  
  <releases>
    <release version="2.13.0" date="2019-07-31">
      Updated CMSIS driver modules conditional compilation
      CAN driver remove lower baudrate restrictions
      CAN driver fix IRQ handler when more than one message object allocated per CAN node
      Update of XMC Lib to v2.1.24
      Added XMCLib examples
    </release>  
    <release version="2.12.1" date="2019-07-17">
      Changed URL
      Note: The new PACK download address is https://www.infineon.com/cmsis_packs/  
    </release>      
    <release version="2.12.0" date="2019-06-04">
      Update of XMC Lib to v2.1.22
      Updated documentation
      Fix variable location of SystemCoreClock, g_hrpwm_char_data and g_chipid for ARMCC compiler
      Added XMC4800 IoT Connectivity Kit
      Fixed flash programming algorithms to avoid last page garbage from last programming
      Upgraded CMSIS-RTOS RTX IFX implementation to v4.82
      Note: The new PACK download address is https://github.com/Infineon/cmsis_packs/  
    </release>      
    <release version="2.11.0" date="2018-10-22">
      Update of XMC Lib to v2.1.20
      Remove CMSIS RTOS dependency of CMSIS ETH_MAC Driver
      Fixes issues in SPI and UART drivers 
    </release>      
    <release version="2.10.0" date="2017-12-20">
      Updated XMCLib to v2.1.18
      Improved CMSIS drivers compatibility with ARM v6 compiler
      Update system_4xxx.c to disable the FPU if not used
      Fixes for SPI and I2C CMSIS drivers      
    </release>
    <release version="2.9.1" date="2017-09-07">
      Fix POSIF compilation issue
    </release>
    <release version="2.9.0" date="2017-08-07">
      Updated XMCLib to v2.1.16
    </release>
    <release version="2.8.0" date="2017-06-30">
      Updated Infineon CMSIS-CORE files
      Updated XMCLib to v2.1.16
      Changed ETH_MAC_PowerControl to improve bus accesss and mask off IPC_RECEIVE_INTERRUPT
      Fixed ETH_MAC_SendFrame allowing the parameter combination (frame = NULL, len = 0) used to discard the ethernet frame.
      Added ETH_PHY component
      Added XMC4800 Automation Board
      Added support for ARM Compiler 6 (armclang) 
    </release>
    <release version="2.7.1" date="2016-10-21">
      Fix: Remove spaces in Dnames
      Fix: Description of MCI, CAN and SAI drivers
      Fix: UART driver when sending a single byte and FIFO enabled
      Fix: Board support LED and BUTTON interface implementation
    </release>
    <release version="2.7.0" date="2016-09-09">    
      Update Infineon CMSIS-CORE files
      Update of XMC Lib to v2.1.8   
      Added MCI, CAN and I2S driver
    </release>
    <release version="2.6.0" date="2016-05-13">    
      Infineon CMSIS-Core files
      Added conditions of selecting startup file for following devices:
            XMC4100, XMC4104, XMC4108, XMC4400, XMC4402, XMC4500, XMC4502, XMC4504,
       Update of XMC Lib to v2.1.6    
       Add support for GCC and IAR
       Add Quick Start Guide from Keil
       Add USB Host driver and example project  
     Update of RTE drivers
       Update of documents
    </release>
    <release version="2.5.0" date="2016-02-19">    
      Infineon CMSIS-Core files released 19. February 2016
      Added Devices: XMC4300-F100x256
      Update of XMC Lib to v2.1.4
      Fixed IRQ handler names for SPI, I2c and UART      
      Added Network component examples for XMC4500 Relax Kit
      Added Graphics component example for XMC4500 Application kit
    Added Board Support Pack (BSP) for XMC4500 Application Kit
    Changed "\" to "/" in path    
      Changed the server location to http://dave.infineon.com/Libraries/CMSIS_PACK
    </release> 
    <release version="2.4.0">
      Infineon CMSIS-Core files released 30. October 2015 
      Added Devices: XMC4700-E196x2048, XMC4700-F144x2048, XMC4700-F100x2048,
                     XMC4700-E196x1536, XMC4700-F144x1536, XMC4700-F100x1536
                     XMC4800-E196x2048, XMC4800-F144x2048, XMC4800-F100x2048,
                     XMC4800-E196x1536, XMC4800-F144x1536, XMC4800-F100x1536,
                     XMC4800-E196x1024, XMC4800-F144x1024, XMC4800-F100x1024,
      Update of XMC Lib to v2.1.2
      Updated of CMSIS files
    </release>  
    <release version="2.3.0">
      Infineon CMSIS-Core files released 24. July 2015
      Update of XMC Lib to v2.0
      Update of RTE driver            
      Added device: XMC4108-F64x64
      Add new conditions for RTE driver
      Add CMSIS driver example (I2C) and Middleware example (Virtual COM) 
    </release> 
    <release version="2.2.0">
      Infineon CMSIS-Core files released 18. February 2015
      Update of Infineon CMSIS files (header, SVD, startup)
      Add new CMSIS drivers (UART, SPI and I2C)
      Add low level driver (LLD) package and example projects
      Add Board Support Pack (BSP)for XMC4500 Relax Lite Kit      
    </release> 
    <release version="2.1.1">
      Infineon CMSIS-Core files released 11. December 2014
      Update of system_XMC4xxx.c files 
    </release> 
    <release version="2.1.0">
      Infineon CMSIS-Core files released 08. December 2014
      Update of Infineon CMSIS files (header, SVD, startup)
      Update of documents
      Update of family name from XMC4000 Series to XMC4000
      Update of applicatiob board naming.
      Added device: XMC4108-F64x64
    </release>
    <release version="2.0.1">
      Infineon CMSIS-Core files released 27. June 2014
      Update the value of Dfpu for Floating Point Unit (FPU) from 1 to FPU 
      Update the value of Dmpu for Memory Protection Unit (MPU) from 1 to MPU 
    </release>
     <release version="2.0.0">
      Infineon CMSIS-Core files released 16. June 2014
      Add the XMC4500 Relax Lite Kit
      Add USB driver and examples for XMC4500 Application Kit and Relax Lite kit 
      update the SVD files     
    </release>
     <release version="1.5.0">
      Infineon CMSIS-Core files released 25. April 2014
      Adjust the version number to Keil pack release
      Add the assembler preprocessor --cpreproc  
      Add compiler conditions for IAR and GCC      
    </release>
    <release version="1.0.2">
      Infineon CMSIS-Core files released 28. January 2014
      Changes: Complete names of derivative devices are listed to be consistent with DAVE3.
    </release>
    <release version="1.0.1">
      Infineon CMSIS-Core files released 19. July 2013
    </release>
    <release version="1.0.0">
      First Release version of XMC4000 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Infineon</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Infineon</keyword>
    <keyword>XMC4000</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="XMC4000" Dvendor="Infineon:7">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="FPU" Dmpu="MPU" Dendian="Little-endian"/>      
      <book    name="Documents/ddi0439c_cortex_m4_r0p1_trm.pdf"       title="Cortex-M4 Technical Reference Manual"/>
      <book    name="Documents/dui0553a_cortex_m4_dgug.pdf"           title="Cortex-M4 Generic User Guide"/>
      <description>
      The XMC4000 family marks a cornerstone in microcontroller design for 
      real-time critical systems. With XMC4000 Infineon combines its leading-edge 
      peripheral set with an industry-standard ARM® Cortex™-M4 core. Featuring 
      Infineon’s powerful peripheral set, configurable to specific application 
      requirements, XMC4000 is the ultimate choice for today’s industrial control 
      solutions. This family is designed to tackle the imminent challenges of 
      improving energy efficiency, supporting advanced communication protocols, 
      and reducing time-to-market. Family members operate even in high-temperature 
      environments of up to 125 °C, granting you access to their exceptional performance 
      in all corners of your system.
          </description>
      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>
      
      <feature type="RTC"           n="1"/>
      <feature type="WDT"           n="1"/>
      <feature type="DAC"           n="2"   m="12"/>
      <feature type="NVIC"          n="112"                          name="NVIC"/>

