mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <condition id="XMC4104_F64">                                     
      <description>Infineon XMC4104 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4104-F64*"/>
    </condition>

    <condition id="XMC4104_Q48">                                     
      <description>Infineon XMC4104 series VQFN48</description>
      <require Dvendor="Infineon:7" Dname="XMC4104-Q48*"/>
    </condition>    
 
    <condition id="XMC4108_F64">                                     
      <description>Infineon XMC4108 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4108-F64*"/>
    </condition>

    <condition id="XMC4108_Q48">                                     
      <description>Infineon XMC4108 series VQFN48</description>
      <require Dvendor="Infineon:7" Dname="XMC4108-Q48*"/>
    </condition>     
  
    <condition id="XMC4100_ARMCC">                                     
      <description>Infineon XMC4100 series</description>
      <accept condition="XMC4100_Q48"/>
      <accept condition="XMC4100_F64"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4104_ARMCC"> 
      <description>Infineon XMC4104 series</description>  
      <accept condition="XMC4104_Q48"/>
      <accept condition="XMC4104_F64"/>
      <require Tcompiler="ARMCC"/>
    </condition>
  
    <condition id="XMC4108_ARMCC">  
      <description>Infineon XMC4108 series</description>  
      <accept condition="XMC4108_Q48"/>
      <accept condition="XMC4108_F64"/>
      <require Tcompiler="ARMCC"/>
    </condition>
  
    <condition id="XMC4100_GCC">                                     
      <description>Infineon XMC4100 series</description>
      <accept condition="XMC4100_Q48"/>
      <accept condition="XMC4100_F64"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4100_128_GCC">
      <description>Infineon XMC4100 series 128K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4100-*x128"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4104_GCC"> 
      <description>Infineon XMC4104 series</description>  
      <accept condition="XMC4104_Q48"/>
      <accept condition="XMC4104_F64"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4104_128_GCC">
      <description>Infineon XMC4104 series 128K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4104-*x128"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4104_64_GCC">
      <description>Infineon XMC4104 series 64K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4104-*x64"/>
      <require Tcompiler="GCC"/>
    </condition>
  
    <condition id="XMC4108_GCC">  
      <description>Infineon XMC4108 series</description>  
      <accept condition="XMC4108_Q48"/>
      <accept condition="XMC4108_F64"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4108_64_GCC">
      <description>Infineon XMC4108 series 64K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4108-*x64"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4100_IAR">                                     
      <description>Infineon XMC4100 series</description>
      <accept condition="XMC4100_Q48"/>
      <accept condition="XMC4100_F64"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="XMC4104_IAR"> 
      <description>Infineon XMC4104 series</description>  
      <accept condition="XMC4104_Q48"/>
      <accept condition="XMC4104_F64"/>
      <require Tcompiler="IAR"/>
    </condition>
  
    <condition id="XMC4108_IAR">  
      <description>Infineon XMC4108 series</description>  
      <accept condition="XMC4108_Q48"/>
      <accept condition="XMC4108_F64"/>
      <require Tcompiler="IAR"/>
    </condition>
  
    <condition id="XMC41xx">    
      <description>Infineon XMC41xx series</description>  
      <accept condition="XMC4100_Q48"/>
      <accept condition="XMC4100_F64"/>
      <accept condition="XMC4104_Q48"/>
      <accept condition="XMC4104_F64"/>
      <accept condition="XMC4108_Q48"/>
      <accept condition="XMC4108_F64"/>
    </condition>

    <condition id="XMC4200_F64">                                     
      <description>Infineon XMC4200 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4200-F64*"/>
    </condition>

    <condition id="XMC4200_Q48">                                     
      <description>Infineon XMC4200 series VQFN48</description>
      <require Dvendor="Infineon:7" Dname="XMC4200-Q48*"/>
    </condition>    
    
    <condition id="XMC42xx">                                     
      <description>Infineon XMC42xx series</description>
      <accept condition="XMC4200_Q48"/>
      <accept condition="XMC4200_F64"/>
    </condition>

    <condition id="XMC42xx_ARMCC">                                     
      <description>Infineon XMC42xx series</description>
      <accept condition="XMC4200_Q48"/>
      <accept condition="XMC4200_F64"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC42xx_GCC">                                     
      <description>Infineon XMC42xx series</description>
      <accept condition="XMC4200_Q48"/>
      <accept condition="XMC4200_F64"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC42xx_256_GCC">
      <description>Infineon XMC4200 series 256K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4200-*x256"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC42xx_IAR">                                     
      <description>Infineon XMC42xx series</description>
      <accept condition="XMC4200_Q48"/>
      <accept condition="XMC4200_F64"/>
      <require Tcompiler="IAR"/>
    </condition>

