mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <condition id="XMC4300_F100">                                     
      <description>Infineon XMC4300 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4300-F100*"/>
    </condition>

    <condition id="XMC43xx">                                     
      <description>Infineon XMC43xx series</description>
      <accept condition="XMC4300_F100"/>
    </condition>

    <condition id="XMC43xx_ARMCC">                                     
      <description>Infineon XMC43xx series</description>
      <accept condition="XMC4300_F100"/>
      <require Tcompiler="ARMCC"/>      
    </condition>

    <condition id="XMC43xx_GCC">                                     
      <description>Infineon XMC43xx series</description>
      <accept condition="XMC4300_F100"/>
      <require Tcompiler="GCC"/>      
    </condition>

    <condition id="XMC43xx_256_GCC">                                     
      <description>Infineon XMC4300 series 256K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4300-*x256"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC43xx_IAR">                                     
      <description>Infineon XMC43xx series</description>
      <accept condition="XMC4300_F100"/>
      <require Tcompiler="IAR"/>      
    </condition>

    <condition id="XMC4400_F100">                                     
      <description>Infineon XMC4400 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4400-F100*"/>
    </condition>

    <condition id="XMC4400_F64">                                     
      <description>Infineon XMC4400 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4400-F64*"/>
    </condition>

    <condition id="XMC4402_F100">                                     
      <description>Infineon XMC4402 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4402-F100*"/>
    </condition>

    <condition id="XMC4402_F64">                                     
      <description>Infineon XMC4402 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4402-F64*"/>
    </condition>    

    <condition id="XMC4400_ARMCC">                                     
      <description>Infineon XMC4400 series</description>
      <accept condition="XMC4400_F100"/>
      <accept condition="XMC4400_F64"/>
      <require Tcompiler="ARMCC"/>
    </condition>
 
    <condition id="XMC4402_ARMCC">                                     
      <description>Infineon XMC4402 series</description>
      <accept condition="XMC4402_F64"/>
      <accept condition="XMC4402_F100"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4400_GCC">                                     
      <description>Infineon XMC4400 series</description>
      <accept condition="XMC4400_F100"/>
      <accept condition="XMC4400_F64"/>
      <require Tcompiler="GCC"/>
    </condition>
 
    <condition id="XMC4400_256_GCC">                                     
      <description>Infineon XMC4400 series 256K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4400-*x256"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4400_512_GCC">                                     
      <description>Infineon XMC4400 series 512K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4400-*x512"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4402_GCC">                                     
      <description>Infineon XMC4402 series</description>
      <accept condition="XMC4402_F64"/>
      <accept condition="XMC4402_F100"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4402_256_GCC">                                     
      <description>Infineon XMC4402 series 512K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4402-*x256"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4400_IAR">                                     
      <description>Infineon XMC4400 series</description>
      <accept condition="XMC4400_F100"/>
      <accept condition="XMC4400_F64"/>
      <require Tcompiler="IAR"/>
    </condition>
 
    <condition id="XMC4402_IAR">                                     
      <description>Infineon XMC4402 series</description>
      <accept condition="XMC4402_F64"/>
      <accept condition="XMC4402_F100"/>
      <require Tcompiler="IAR"/>
    </condition>
  
    <condition id="XMC44xx">                                     
      <description>Infineon XMC44xx series</description>
      <accept condition="XMC4400_F100"/>
      <accept condition="XMC4400_F64"/>
      <accept condition="XMC4402_F64"/>
      <accept condition="XMC4402_F100"/>
    </condition>
    
    <condition id="XMC4500_F144">                                     
      <description>Infineon XMC4500 series LQFP144</description>
      <require Dvendor="Infineon:7" Dname="XMC4500-?144*"/>
    </condition>

    <condition id="XMC4500_F100">                                     
      <description>Infineon XMC4500 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4500-F100*"/>
    </condition>

    <condition id="XMC4502_F100">                                     
      <description>Infineon XMC4502 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4502-F100*"/>
    </condition>

    <condition id="XMC4504_F144">                                     
      <description>Infineon XMC4504 series LQFP144</description>
      <require Dvendor="Infineon:7" Dname="XMC4504-F144*"/>
    </condition>

    <condition id="XMC4504_F100">                                     
      <description>Infineon XMC4504 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4504-F100*"/>
    </condition>

    <condition id="XMC4500_ARMCC">                                     
      <description>Infineon XMC4500 series</description>
      <accept condition="XMC4500_F144"/>
      <accept condition="XMC4500_F100"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4502_ARMCC">                                     
      <description>Infineon XMC4502 series</description>
      <accept condition="XMC4502_F100"/>
      <require Tcompiler="ARMCC"/>
    </condition>
  
    <condition id="XMC4504_ARMCC">                                     
      <description>Infineon XMC4504xseries</description>
      <accept condition="XMC4504_F100"/>
      <accept condition="XMC4504_F144"/>
      <require Tcompiler="ARMCC"/>
    </condition>  

