mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <condition id="XMC48xx_IAR">                                     
      <description>Infineon XMC48xx series</description>
      <accept condition="XMC4800_E196"/>
      <accept condition="XMC4800_F100"/>
      <accept condition="XMC4800_F144"/>
      <require Tcompiler="IAR"/>
    </condition>
    
    <condition id="XMC4 GCC">                                     
      <description>Infineon XMC4000 family and GCC compiler</description>
      <accept  condition="XMC41xx"/>
      <accept  condition="XMC42xx"/> 
      <accept  condition="XMC43xx"/>    
      <accept  condition="XMC44xx"/>      
      <accept  condition="XMC45xx"/>  
      <accept  condition="XMC47xx"/>      
      <accept  condition="XMC48xx"/>
      <require Tcompiler="GCC"/>
    </condition> 

    <condition id="XMC4 IAR">                                     
      <description>Infineon XMC4000 family and GCC compiler</description>
      <accept  condition="XMC41xx"/>
      <accept  condition="XMC42xx"/> 
      <accept  condition="XMC43xx"/>    
      <accept  condition="XMC44xx"/>      
      <accept  condition="XMC45xx"/>  
      <accept  condition="XMC47xx"/>      
      <accept  condition="XMC48xx"/>
      <require Tcompiler="IAR"/>
    </condition> 

    <condition id="XMC4 ARMCC">                                     
      <description>Infineon XMC4000 family and GCC compiler</description>
      <accept  condition="XMC41xx"/>
      <accept  condition="XMC42xx"/> 
      <accept  condition="XMC43xx"/>    
      <accept  condition="XMC44xx"/>      
      <accept  condition="XMC45xx"/>  
      <accept  condition="XMC47xx"/>      
      <accept  condition="XMC48xx"/>
      <require Tcompiler="ARMCC"/>
    </condition> 

    <condition id="XMC4">                                     
      <description>Infineon XMC4000 family</description>
      <accept  condition="XMC41xx"/>
      <accept  condition="XMC42xx"/> 
      <accept  condition="XMC43xx"/>    
      <accept  condition="XMC44xx"/>      
      <accept  condition="XMC45xx"/>  
      <accept  condition="XMC47xx"/>      
      <accept  condition="XMC48xx"/>
    </condition>

    <condition id="XMC4 CMSIS">
      <description>Infineon XMC4000 family and CMSIS-CORE and ARMCC compiler</description>
      <require condition="XMC4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>   
    </condition>

    <condition id="XMC4 CMSIS SCU">
      <description>Infineon XMC4000 family and CMSIS-CORE and ARMCC compiler</description>
      <require condition="XMC4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>   
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
    </condition>

    <condition id="XMC4 CMSIS Driver Ethernet MAC">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver Ethernet MAC</description>
      <accept  condition="XMC48xx"/>
      <accept  condition="XMC47xx"/>
      <accept  condition="XMC43xx"/>
      <accept  condition="XMC4500_F144"/>
      <accept  condition="XMC4500_F100"/>
      <accept  condition="XMC4400_F100"/>
      <accept  condition="XMC4400_F64"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>              
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
    </condition>    

    <condition id="XMC4 CMSIS Driver USBD">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USBD</description>
      <accept  condition="XMC48xx"/>
      <accept  condition="XMC47xx"/>
      <accept  condition="XMC4500_F144"/>
      <accept  condition="XMC4500_F100"/>
      <accept  condition="XMC4502_F100"/>
      <accept  condition="XMC44xx"/>
      <accept  condition="XMC42xx"/>
      <accept  condition="XMC4100_F64"/>
      <accept  condition="XMC4100_Q48"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>               
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>   
    </condition>    

    <condition id="XMC4 CMSIS Driver USBH">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USBH</description>
      <accept  condition="XMC48xx"/>
      <accept  condition="XMC47xx"/>
      <accept  condition="XMC4500_F144"/>
      <accept  condition="XMC4500_F100"/>
      <accept  condition="XMC4502_F100"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>               
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>   
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>   
    </condition>    
    
    <condition id="XMC4 CMSIS Driver I2C">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver I2C</description>
      <require condition="XMC4 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="I2C"/>
    </condition>    
    
    <condition id="XMC4 CMSIS Driver SPI">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver SPI</description>
      <require condition="XMC4 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
    </condition>    

    <condition id="XMC4 CMSIS Driver USART">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <require condition="XMC4 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="UART"/>
    </condition>    

    <condition id="XMC4 CMSIS Driver SAI">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver SAI</description>
      <require condition="XMC4 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="I2S"/>
    </condition>    

