mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  
    
    <example name="USB Human Interface Device" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/Middleware/USB/Device/HID" version="1.0.0">
      <description> USB HID example using MDK-Professional Middleware</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="XMC4500_App_Kit_USB_HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>
    
    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/Middleware/USB/Device/MassStorage" version="1.0.0">
      <description> USB MSC example using MDK-Professional Middleware</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>      
    
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/Middleware/USB/Device/VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  

    <example name="USB Host Mass Storage" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/Middleware/USB/Host/MassStorage" version="1.0.0">
      <description> USB Host MSC example using MDK-Professional Middleware</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="MSC_XMC4500_host.uvprojx"/>
      </project>
      <attributes>    
        <component Cclass="USB" Cgroup="Host" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Mass Storage</keyword>
      </attributes>
    </example> 

    <example name="CMSIS_DRIVER_I2C" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/CMSIS_DRIVER_I2C">
      <description>CMSIS DRIVER I2C example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="I2C_HMI_communication.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="I2C"/>
        <category>Getting Started</category>
      </attributes>
    </example>      

    <example name="CMSIS_DRIVER_SAI" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/CMSIS_DRIVER_SAI">
      <description>CMSIS DRIVER SAI example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="cmsis_driver_sai.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="I2C"/>
        <category>Getting Started</category>
      </attributes>
    </example>      
    
    <example name="Network HTTP Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/Middleware/Network/HTTP_Server" version="1.0.0">
      <description> HTTP Server using MDK-Professional Middleware</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>   
      </attributes>
    </example>  

    <example name="Network Telnet Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/Middleware/Network/Telnet_Server" version="1.0.0">
      <description> Telnet Server using MDK-Professional Middleware</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>    
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>   
      </attributes>
    </example>  

    <example name="Network FTP Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/Middleware/Network/FTP_Server" version="1.0.0">
      <description> FTP Server using MDK-Professional Middleware</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="FTP_Server.uvprojx"/>
      </project>
      <attributes>    
        <component Cclass="Network" Cgroup="Service" Csub="FTP Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>FTP</keyword>   
      </attributes>
    </example>  

    <!-- Infineon XMC4500 Relax Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4500 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4500 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

    <example name="CMSIS_DRIVER_UART" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Relax Kit/CMSIS_DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC4500 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="UART"/>
        <category>Getting Started</category>
      </attributes>
    </example>      

