mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards/Infineon/XMC4800 Relax Kit/Middleware/USB/Device/MassStorage" version="1.0.2">
      <description>USB MSC example using MDK-Professional Middleware</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>      
    
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards/Infineon/XMC4800 Relax Kit/Middleware/USB/Device/VirtualCOM" version="1.0.2">
      <description>USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  

    <example name="USB Human Interface Device" doc="Abstract.txt" folder="Boards/Infineon/XMC4800 Relax Kit/Middleware/USB/Device/HID" version="1.0.2">
      <description> USB HID example using MDK-Professional Middleware</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Relax_USB_HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>

    <example name="emWin Example" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/emWin/Example" version="1.0.0">
      <description>emWin Graphics simple example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="CAN_LOOPBACK" doc="Abstract.txt" folder="Boards/Infineon/XMC4700 Relax Kit/CAN/CAN_LOOPBACK">
      <description>CMSIS DRIVER CAN LOOPBACK example</description>
      <board name="XMC4700 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="CAN_LOOPBACK.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="CAN"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="CAN_TRANSMIT" doc="Abstract.txt" folder="Boards/Infineon/XMC4700 Relax Kit/CAN/CAN_TRANSMIT">
      <description>CMSIS DRIVER CAN TRANSMIT example</description>
      <board name="XMC4700 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="CAN_TRANSMIT.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="CAN"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CAN_REMOTE_TRANSMIT" doc="Abstract.txt" folder="Boards/Infineon/XMC4700 Relax Kit/CAN/CAN_REMOTE_TRANSMIT">
      <description>CMSIS DRIVER CAN REMOTE TRANSMIT example</description>
      <board name="XMC4700 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="CAN_REMOTE_TRANSMIT.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="CAN"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <!-- Infineon XMC4800 Automation Board -->  
    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4800 Automation Board/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4800 Automation Board" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

    <!-- Infineon XMC4 Low Level Driver (LLD) Examples -->

    <!-- XMC4200 Examples -->    
    <example name="GPIO_TOGGLE_XMC42" doc="Readme.txt" folder="Device/XMClib/examples/XMC4200_series/GPIO/GPIO_TOGGLE">
      <description>XMClib GPIO driver example</description>
      <board name="XMC4200 CPU Board - Actuator  (CPU_42A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/gpio_toggle_xmc42.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="SCU_HIB_XMC42" doc="Readme.txt" folder="Device/XMClib/examples/XMC4200_series/SCU/SCU_HIB">
      <description>XMClib SCU driver example that demonstrates the hibernation functionality</description>
      <board name="XMC4200 CPU Board - Actuator  (CPU_42A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/scu_hib_xmc42.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <!-- XMC4300 Examples -->    
    <example name="ERU_HIB_IO" doc="Readme.txt" folder="Device/XMClib/examples/XMC4300_series/ERU/ERU_HIB_IO">
      <description>XMClib ERU driver example</description>
      <board name="XMC4300 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/eru_hib_io_xmc43.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="SPI_EXTTRG_TRANSMIT" doc="Readme.txt" folder="Device/XMClib/examples/XMC4300_series/SPI/SPI_EXTTRG_TRANSMIT">
      <description>XMClib SPI driver example</description>
      <board name="XMC4300 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/spi_exttrg_transmit_xmc43.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <!-- XMC4400 Examples -->    
    <example name="HRPWM_CSG_XMC44" doc="Readme.txt" folder="Device/XMClib/examples/XMC4400_series/HRPWM/HRPWM_CSG"> 
      <description>XMClib High Resolution PWM (HAPWM) driver example - CSG </description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/hrpwm_csg_xmc44.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="HRPWM"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

