mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <example name="HRPWM_HRC_XMC44" doc="Readme.txt" folder="Device/XMClib/examples/XMC4400_series/HRPWM/HRPWM_HRC"> 
      <description>XMClib High Resolution PWM (HAPWM) driver example - HRC </description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/hrpwm_hrc_xmc44.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="HRPWM"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <!-- XMC4500 Examples -->    
    <example name="CAN_LOOPBACK_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/CAN/CAN_LOOPBACK">
      <description>XMClib CAN example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_loopback_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CAN_RECEIVER_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/CAN/CAN_RECEIVER">
      <description>XMClib CAN example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_receiver_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CAN_TRANSMITTER_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/CAN/CAN_TRANSMITTER">
      <description>XMClib CAN example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_transmitter_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CCU4_TIMER_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/CCU4/CCU4_TIMER">
      <description>XMClib CCU4 example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CCU8_TIMER_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/CCU8/CCU8_TIMER">
      <description>XMClib CCU8 example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu8_timer_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU8"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="DAC_SINE_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/DAC/DAC_SINE">
      <description>XMClib DAC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dac_sine_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DAC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>   

    <example name="DMA_M2M_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/DMA/DMA_M2M">
      <description>XMClib DMA example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dma_m2m_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DMA"/>       
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="DMA_FCE_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/DMA/DMA_FCE">
      <description>XMClib DMA example that feeds the FCE to calculate the CRC of a stream of data</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dma_fce_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>       
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>       
        <component Cclass="Device" Cgroup="XMClib" Csub="DMA"/>       
        <component Cclass="Device" Cgroup="XMClib" Csub="FCE"/>       
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="DMA_UART_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/DMA/DMA_UART">
      <description>XMClib DMA example that feeds the UART</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dma_uart_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>       
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>       
        <component Cclass="Device" Cgroup="XMClib" Csub="DMA"/>       
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>       
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="ERU_EXTINT_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/ERU/ERU_EXTINT"> 
      <description>XMClib ERU external interrupt example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/eru_extint_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>  
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>               
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="FCE_CRC_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/FCE/FCE_CRC">
      <description>XMClib FCE example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/fce_crc_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FCE"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="FLASH_PROGRAM_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/FLASH/FLASH_PROGRAM"> 
      <description>XMClib FLASH example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/flash_program_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FLASH"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

