mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <example name="FLASH_PROTECTION_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/FLASH/FLASH_PROTECTION"> 
      <description>XMClib FLASH example demonstrating protection features</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/flash_protection_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>  
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>               
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>               
        <component Cclass="Device" Cgroup="XMClib" Csub="FLASH"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="GPIO_TOGGLE_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/GPIO/GPIO_TOGGLE"> 
      <description>XMClib GPIO toggle example flashes the leds of the board with a periodic rate</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/gpio_toggle_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example>                    

    <example name="I2C_TRANSFER_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/I2C/I2C_TRANSFER">
      <description>XMClib I2C example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/i2c_transfer_xmc45.uvprojx"/>     
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="I2C"/>   
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>              
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="LEDTS_TOUCH_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/LEDTS/LEDTS_TOUCH">
      <description>XMClib LEDTS example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ledts_touch_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>         
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="RTC_ALARM_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/RTC/RTC_ALARM">
      <description>XMClib RTC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/rtc_alarm_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="RTC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="SCU_BROWNOUT_DETECTION_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/SCU/SCU_BROWNOUT_DETECTION">
      <description>XMClib SCU driver example that demonstrates the voltage monitoring features</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/scu_brownout_detection_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>          
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="SPI_TRANSMIT_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/SPI/SPI_TRANSMIT">
      <description>XMClib SPI example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/spi_transmit_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>          
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="SPI_DMA_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/SPI/SPI_DMA">
      <description>XMClib SPI example that uses the DMA</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/spi_dma_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>          
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>          
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DMA"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

