mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <example name="UART_TRANSMIT_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/UART/UART_TRANSMIT">
      <description>XMClib UART example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_transmit_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="UART_SHELL_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/UART/UART_SHELL">
      <description>XMClib UART example that implements a simple shell</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_shell_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>          
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>          
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="VADC_MEASUREMENT_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/VADC/VADC_MEASUREMENT">
      <description>XMClib VADC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="VADC_MEASUREMENT_EMUX_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/VADC/VADC_MEASUREMENT_EMUX">
      <description>XMClib VADC example that demonstrates the usage of the channel muxing capabilities</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement_emux_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>          
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>          
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="VADC_MEASUREMENT_TRIGGERED_CCU8_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/VADC/VADC_MEASUREMENT_TRIGGERED_CCU8">
      <description>XMClib VADC example where conversions are triggered by a timer</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement_triggered_ccu8_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>          
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>          
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="WDT_FEED_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/WDT/WDT_FEED">
      <description>XMClib WDT example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/wdt_feed_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="EBU_SDRAM_XMC45" doc="Readme.txt" folder="Device/XMClib/examples/XMC4500_series/EBU/EBU_SDRAM">
      <description>XMClib EBU example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45B)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ebu_sdram_xmc45.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="EBU"/>
        <category>LLD Examples</category>
      </attributes>
    </example>  

    <!-- XMC4800 Examples -->    
    <example name="CAN_RECEIVER_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/CAN/CAN_RECEIVER">
      <description>XMClib CAN receiver example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_receiver_xmc48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CAN_TRANSMITTER_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/CAN/CAN_TRANSMITTER">
      <description>XMClib CAN transmitter example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_transmitter_xmc48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CCU4_TIMER_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/CCU4/CCU4_TIMER">
      <description>XMClib CCU4 example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer_xmc48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CCU4_TIMER_CONCATENATION_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/CCU4/CCU4_TIMER_CONCATENATION">
      <description>XMClib CCU4 example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer_concatenation_xmc48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="DAC_SINE_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/DAC/DAC_SINE">
      <description>XMClib DAC example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/dac_sine_xmc48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="DAC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>   


    <example name="DMA_PWM_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/DMA/DMA_PWM">
      <description>XMClib DMA example that generates a varying PWM signal</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/DMA_PWM_XMC48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="DMA"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>   

    <example name="DMA_RING_BUFFER_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/DMA/DMA_RING_BUFFER">
      <description>XMClib DMA example that implements a double buffer using the linked list feature of the DMA</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/DMA_RING_BUFFER_XMC48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="DMA"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>   

    <example name="VADC_MEASUREMENT_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/VADC/VADC_MEASUREMENT">
      <description>XMClib VADC example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement_xmc48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

