mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <example name="ECAT_ETH_LOOP_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/ECAT/ECAT_ETH_LOOP">
      <description>XMClib ECAT example that shows EtherCAT (slave) and Etehrnet (master) configuration</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ECAT_ETH_LOOP_XMC48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="ETH_MAC"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ETH_PHY"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ECAT"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="EBU_SDRAM_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/EBU/EBU_SDRAM">
      <description>XMClib ECAT example that shows EtherCAT (slave) and Etehrnet (master) configuration</description>
      <board name="XMC4800 Automation Board" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/EBU_SDRAM_XMC48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="EBU"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="FLASH_EEPROM_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/FLASH/FLASH_EEPROM">
      <description>XMClib FLASH example that implements EEPROM emulation</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/flash_eeprom_xmc48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="FLASH"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FCE"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="UART_PRINTF_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/UART/UART_PRINTF">
      <description>XMClib UART example that retargets printf the text can be displayed in a terminal emulator</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_printf_xmc48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="WDT_PREWARNING_XMC48" doc="Readme.txt" folder="Device/XMClib/examples/XMC4800_series/WDT/WDT_PREWARNING">
      <description>XMClib WDT example</description>
      <board name="XMC4800 Relax EtherCAT Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/wdt_prewarning_xmc48.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>
        <category>LLD Examples</category>
      </attributes>
    </example>

  </examples>
  
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.2.4" condition="XMC4 CMSIS">
      <description>System Startup for Infineon XMC4000 family</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STARTUP
      </RTE_Components_h>
      
      <files>
        <!--  include folder -->
        <file category="include" name="Device/XMC4100_series/Include/" condition="XMC41xx"/>
        <file category="include" name="Device/XMC4200_series/Include/" condition="XMC42xx"/>
        <file category="include" name="Device/XMC4300_series/Include/" condition="XMC43xx"/>
        <file category="include" name="Device/XMC4400_series/Include/" condition="XMC44xx"/>
        <file category="include" name="Device/XMC4500_series/Include/" condition="XMC45xx"/>
        <file category="include" name="Device/XMC4700_series/Include/" condition="XMC47xx"/>
        <file category="include" name="Device/XMC4800_series/Include/" condition="XMC48xx"/>
        
        <!--  device header file -->
        <file category="header" name="Device/XMC4100_series/Include/XMC4100.h" version="1.6.1" condition="XMC41xx"/>
        <file category="header" name="Device/XMC4200_series/Include/XMC4200.h" version="1.6.1" condition="XMC42xx"/>
        <file category="header" name="Device/XMC4300_series/Include/XMC4300.h" version="1.1.1" condition="XMC43xx"/>
        <file category="header" name="Device/XMC4400_series/Include/XMC4400.h" version="1.6.1" condition="XMC44xx"/>
        <file category="header" name="Device/XMC4500_series/Include/XMC4500.h" version="1.6.1" condition="XMC45xx"/>
        <file category="header" name="Device/XMC4700_series/Include/XMC4700.h" version="1.3.1" condition="XMC47xx"/>
        <file category="header" name="Device/XMC4800_series/Include/XMC4800.h" version="1.3.1" condition="XMC48xx"/>
        
        <!-- system file -->
        <file category="source" name="Device/XMC4100_series/Source/system_XMC4100.c" version="3.2.5" attr="config" condition="XMC41xx"/>
        <file category="source" name="Device/XMC4200_series/Source/system_XMC4200.c" version="3.1.4" attr="config" condition="XMC42xx"/>
        <file category="source" name="Device/XMC4300_series/Source/system_XMC4300.c" version="1.0.6" attr="config" condition="XMC43xx"/>
        <file category="source" name="Device/XMC4400_series/Source/system_XMC4400.c" version="3.1.4" attr="config" condition="XMC44xx"/>
        <file category="source" name="Device/XMC4500_series/Source/system_XMC4500.c" version="3.1.5" attr="config" condition="XMC45xx"/>
        <file category="source" name="Device/XMC4700_series/Source/system_XMC4700.c" version="1.0.6" attr="config" condition="XMC47xx"/>
        <file category="source" name="Device/XMC4800_series/Source/system_XMC4800.c" version="1.0.6" attr="config" condition="XMC48xx"/>
        
        <!-- startup files -->
        <file category="source" name="Device/XMC4100_series/Source/ARM/startup_XMC4100.s" version="1.4.0" attr="config" condition="XMC4100_ARMCC"/>
        <file category="source" name="Device/XMC4100_series/Source/ARM/startup_XMC4104.s" version="1.5.0" attr="config" condition="XMC4104_ARMCC"/>
        <file category="source" name="Device/XMC4100_series/Source/ARM/startup_XMC4108.s" version="1.5.0" attr="config" condition="XMC4108_ARMCC"/>
        <file category="source" name="Device/XMC4200_series/Source/ARM/startup_XMC4200.s" version="1.4.0" attr="config" condition="XMC42xx_ARMCC"/>
        <file category="source" name="Device/XMC4300_series/Source/ARM/startup_XMC4300.s" version="1.1.0" attr="config" condition="XMC43xx_ARMCC"/>
        <file category="source" name="Device/XMC4400_series/Source/ARM/startup_XMC4400.s" version="1.5.0" attr="config" condition="XMC4400_ARMCC"/>
        <file category="source" name="Device/XMC4400_series/Source/ARM/startup_XMC4402.s" version="1.5.0" attr="config" condition="XMC4402_ARMCC"/>
        <file category="source" name="Device/XMC4500_series/Source/ARM/startup_XMC4500.s" version="1.7.0" attr="config" condition="XMC4500_ARMCC"/>
        <file category="source" name="Device/XMC4500_series/Source/ARM/startup_XMC4502.s" version="1.8.0" attr="config" condition="XMC4502_ARMCC"/>
        <file category="source" name="Device/XMC4500_series/Source/ARM/startup_XMC4504.s" version="1.8.0" attr="config" condition="XMC4504_ARMCC"/>
        <file category="source" name="Device/XMC4700_series/Source/ARM/startup_XMC4700.s" version="1.0.0" attr="config" condition="XMC47xx_ARMCC"/>
        <file category="source" name="Device/XMC4800_series/Source/ARM/startup_XMC4800.s" version="1.0.0" attr="config" condition="XMC48xx_ARMCC"/>

        <file category="source" name="Device/XMC4100_series/Source/GCC/startup_XMC4100.S" version="1.0.0" attr="config" condition="XMC4100_GCC"/>
        <file category="source" name="Device/XMC4100_series/Source/GCC/startup_XMC4104.S" version="1.1.0" attr="config" condition="XMC4104_GCC"/>
        <file category="source" name="Device/XMC4100_series/Source/GCC/startup_XMC4108.S" version="1.1.0" attr="config" condition="XMC4108_GCC"/>
        <file category="source" name="Device/XMC4200_series/Source/GCC/startup_XMC4200.S" version="1.0.0" attr="config" condition="XMC42xx_GCC"/>
        <file category="source" name="Device/XMC4300_series/Source/GCC/startup_XMC4300.S" version="1.1.0" attr="config" condition="XMC43xx_GCC"/>
        <file category="source" name="Device/XMC4400_series/Source/GCC/startup_XMC4400.S" version="1.0.0" attr="config" condition="XMC4400_GCC"/>
        <file category="source" name="Device/XMC4400_series/Source/GCC/startup_XMC4402.S" version="1.1.0" attr="config" condition="XMC4402_GCC"/>
        <file category="source" name="Device/XMC4500_series/Source/GCC/startup_XMC4500.S" version="1.20.0" attr="config" condition="XMC4500_GCC"/>
        <file category="source" name="Device/XMC4500_series/Source/GCC/startup_XMC4502.S" version="1.21.0" attr="config" condition="XMC4502_GCC"/>
        <file category="source" name="Device/XMC4500_series/Source/GCC/startup_XMC4504.S" version="1.21.0" attr="config" condition="XMC4504_GCC"/>
        <file category="source" name="Device/XMC4700_series/Source/GCC/startup_XMC4700.S" version="1.1.0" attr="config" condition="XMC47xx_GCC"/>
        <file category="source" name="Device/XMC4800_series/Source/GCC/startup_XMC4800.S" version="1.1.0" attr="config" condition="XMC48xx_GCC"/>
        
        <file category="source" name="Device/XMC4100_series/Source/IAR/startup_XMC4100.s" version="1.2.0" attr="config" condition="XMC4100_IAR"/>
        <file category="source" name="Device/XMC4100_series/Source/IAR/startup_XMC4104.s" version="1.3.0" attr="config" condition="XMC4104_IAR"/>
        <file category="source" name="Device/XMC4100_series/Source/IAR/startup_XMC4108.s" version="1.3.0" attr="config" condition="XMC4108_IAR"/>
        <file category="source" name="Device/XMC4200_series/Source/IAR/startup_XMC4200.s" version="1.2.0" attr="config" condition="XMC42xx_IAR"/>
        <file category="source" name="Device/XMC4300_series/Source/IAR/startup_XMC4300.s" version="1.0.0" attr="config" condition="XMC43xx_IAR"/>
        <file category="source" name="Device/XMC4400_series/Source/IAR/startup_XMC4400.s" version="1.2.0" attr="config" condition="XMC4400_IAR"/>
        <file category="source" name="Device/XMC4400_series/Source/IAR/startup_XMC4402.s" version="1.3.0" attr="config" condition="XMC4402_IAR"/>
        <file category="source" name="Device/XMC4500_series/Source/IAR/startup_XMC4500.s" version="1.2.0" attr="config" condition="XMC4500_IAR"/>
        <file category="source" name="Device/XMC4500_series/Source/IAR/startup_XMC4502.s" version="1.3.0" attr="config" condition="XMC4502_IAR"/>
        <file category="source" name="Device/XMC4500_series/Source/IAR/startup_XMC4504.s" version="1.3.0" attr="config" condition="XMC4504_IAR"/>
        <file category="source" name="Device/XMC4700_series/Source/IAR/startup_XMC4700.s" version="1.0.0" attr="config" condition="XMC47xx_IAR"/>
        <file category="source" name="Device/XMC4800_series/Source/IAR/startup_XMC4800.s" version="1.0.0" attr="config" condition="XMC48xx_IAR"/>

