mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
        <!-- linker files -->
        <file category="linkerScript" name="Device/XMC4100_series/Source/GCC/XMC4100x128.ld"  version="1.8.0" condition="XMC4100_128_GCC"/>
        <file category="linkerScript" name="Device/XMC4100_series/Source/GCC/XMC4104x128.ld"  version="1.8.0" condition="XMC4104_128_GCC"/>
        <file category="linkerScript" name="Device/XMC4100_series/Source/GCC/XMC4104x64.ld"   version="1.8.0" condition="XMC4104_64_GCC"/>
        <file category="linkerScript" name="Device/XMC4100_series/Source/GCC/XMC4108x64.ld"   version="1.8.0" condition="XMC4108_64_GCC"/>
        <file category="linkerScript" name="Device/XMC4200_series/Source/GCC/XMC4200x256.ld"  version="1.8.0" condition="XMC42xx_256_GCC"/>
        <file category="linkerScript" name="Device/XMC4300_series/Source/GCC/XMC4300x256.ld"  version="1.2.0" condition="XMC43xx_256_GCC"/>
        <file category="linkerScript" name="Device/XMC4400_series/Source/GCC/XMC4400x512.ld"  version="1.8.0" condition="XMC4400_512_GCC"/>
        <file category="linkerScript" name="Device/XMC4400_series/Source/GCC/XMC4400x256.ld"  version="1.8.0" condition="XMC4400_256_GCC"/>
        <file category="linkerScript" name="Device/XMC4400_series/Source/GCC/XMC4402x256.ld"  version="1.8.0" condition="XMC4402_256_GCC"/>
        <file category="linkerScript" name="Device/XMC4500_series/Source/GCC/XMC4500x1024.ld" version="1.8.0" condition="XMC4500_1024_GCC"/>
        <file category="linkerScript" name="Device/XMC4500_series/Source/GCC/XMC4500x768.ld"  version="1.8.0" condition="XMC4500_768_GCC"/>
        <file category="linkerScript" name="Device/XMC4500_series/Source/GCC/XMC4502x768.ld"  version="1.8.0" condition="XMC4502_768_GCC"/>
        <file category="linkerScript" name="Device/XMC4500_series/Source/GCC/XMC4504x512.ld"  version="1.8.0" condition="XMC4504_512_GCC"/>
        <file category="linkerScript" name="Device/XMC4700_series/Source/GCC/XMC4700x1536.ld" version="1.3.0" condition="XMC47xx_1536_GCC"/>
        <file category="linkerScript" name="Device/XMC4700_series/Source/GCC/XMC4700x2048.ld" version="1.3.0" condition="XMC47xx_2048_GCC"/>
        <file category="linkerScript" name="Device/XMC4800_series/Source/GCC/XMC4800x1024.ld" version="1.3.0" condition="XMC48xx_1024_GCC"/>
        <file category="linkerScript" name="Device/XMC4800_series/Source/GCC/XMC4800x1536.ld" version="1.3.0" condition="XMC48xx_1536_GCC"/>
        <file category="linkerScript" name="Device/XMC4800_series/Source/GCC/XMC4800x2048.ld" version="1.3.0" condition="XMC48xx_2048_GCC"/>

        <file category="source" name="Compiler/GCC/syscalls.c" version="1.6.0" condition="XMC4 GCC"/>
      </files> 
    </component>
    
    <component Cclass="Device" Cgroup="RTE_Device" Cversion="1.1.0" condition="XMC4 CMSIS">
      <description>RTE Device</description>
      <RTE_Components_h>
        #define RTE_DEVICE
      </RTE_Components_h>  
      <files>
        <file category="include" name="RTE_Driver/"/>   
        <file category="header"  name="RTE_Driver/Config/XMC4200_F64/RTE_Device.h"  version="1.1.0" condition="XMC4100_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4200_Q48/RTE_Device.h"  version="1.1.0" condition="XMC4100_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4104_F64/RTE_Device.h"  version="1.1.0" condition="XMC4104_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4104_Q48/RTE_Device.h"  version="1.1.0" condition="XMC4104_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4108_F64/RTE_Device.h"  version="1.1.0" condition="XMC4108_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4108_Q48/RTE_Device.h"  version="1.1.0" condition="XMC4108_Q48" attr="config"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4200_F64/RTE_Device.h"  version="1.1.0" condition="XMC4200_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4200_Q48/RTE_Device.h"  version="1.1.0" condition="XMC4200_Q48" attr="config"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4300_F100/RTE_Device.h" version="1.1.0" condition="XMC4300_F100" attr="config"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4400_F64/RTE_Device.h"  version="1.1.0" condition="XMC4400_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4400_F100/RTE_Device.h" version="1.1.0" condition="XMC4400_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4402_F64/RTE_Device.h"  version="1.1.0" condition="XMC4402_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4402_F100/RTE_Device.h" version="1.1.0" condition="XMC4402_F100" attr="config"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4500_F100/RTE_Device.h" version="1.1.0" condition="XMC4500_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4500_F144/RTE_Device.h" version="1.1.0" condition="XMC4500_F144" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4502_F100/RTE_Device.h" version="1.1.0" condition="XMC4502_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4504_F100/RTE_Device.h" version="1.1.0" condition="XMC4504_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4504_F144/RTE_Device.h" version="1.1.0" condition="XMC4504_F144" attr="config"/>
        
        <file category="header"  name="RTE_Driver/Config/XMC4800_E196/RTE_Device.h" version="1.1.0" condition="XMC4700_E196" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4800_F100/RTE_Device.h" version="1.1.0" condition="XMC4700_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4800_F144/RTE_Device.h" version="1.1.0" condition="XMC4700_F144" attr="config"/>

        <file category="header"  name="RTE_Driver/Config/XMC4800_E196/RTE_Device.h" version="1.1.0" condition="XMC4800_E196" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4800_F100/RTE_Device.h" version="1.1.0" condition="XMC4800_F100" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC4800_F144/RTE_Device.h" version="1.1.0" condition="XMC4800_F144" attr="config"/>
      </files>
    </component>

