mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <component Cvendor="ARM" Cclass="CMSIS" Cgroup="RTOS" Csub="Keil RTX" Cversion="4.82.1" Capiversion="1.0.0" Cvariant="IFX" isDefaultVariant="1" condition="XMC4 CMSIS">
      <description>CMSIS-RTOS RTX optimized implementation for Infineon XMC4 series not affected by PMU_CM.001 errata</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_CMSIS_RTOS                  /* CMSIS-RTOS */
        #define RTE_CMSIS_RTOS_RTX              /* CMSIS-RTOS Keil RTX */
      </RTE_Components_h>
      <files>
        <!-- CPU independent -->
        <file category="doc" name="CMSIS/RTOS/RTX/index.html"/>
        <file category="header" name="CMSIS/RTOS/RTX/INC/cmsis_os.h"/>
        <file category="source" attr="config"   name="CMSIS/RTOS/RTX/Templates/RTX_Conf_CM.c" version="4.70.1"/>
        
        <!-- RTX templates -->
        <file category="header" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/osObjects.h" select="CMSIS-RTOS 'main' function"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/main.c"      select="CMSIS-RTOS 'main' function"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/MailQueue.c" select="CMSIS-RTOS Mail Queue"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/MemPool.c"   select="CMSIS-RTOS Memory Pool"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/MsgQueue.c"  select="CMSIS-RTOS Message Queue"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/Mutex.c"     select="CMSIS-RTOS Mutex"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/Semaphore.c" select="CMSIS-RTOS Semaphore"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/Thread.c"    select="CMSIS-RTOS Thread"/>
        <file category="source" attr="template" name="CMSIS/RTOS/RTX/UserCodeTemplates/Timer.c"     select="CMSIS-RTOS Timer"/>
        <!-- tool-chain specific template file -->
        <file category="source" attr="template" condition="ARMCC" name="CMSIS/RTOS/RTX/SRC/ARM/SVC_Table.s" select="CMSIS-RTOS User SVC"/>
        <file category="source" attr="template" condition="GCC"   name="CMSIS/RTOS/RTX/SRC/GCC/SVC_Table.S" select="CMSIS-RTOS User SVC"/>
        <file category="source" attr="template" condition="IAR"   name="CMSIS/RTOS/RTX/SRC/IAR/SVC_Table.s" select="CMSIS-RTOS User SVC"/>

        <!-- CPU and Compiler dependent -->
        <!-- ARMCC -->
        <file category="library" condition="ARMCC" name="CMSIS/RTOS/RTX/LIB/ARM/RTX_CM4.lib"      src="CMSIS/RTOS/RTX/SRC/ARM"/>
        <!-- GCC -->
        <file category="library" condition="GCC"   name="CMSIS/RTOS/RTX/LIB/GCC/libRTX_CM4.a"     src="CMSIS/RTOS/RTX/SRC/GCC"/>
        <!-- IAR -->
        <file category="library" condition="IAR"   name="CMSIS/RTOS/RTX/LIB/IAR/RTX_CM4.a"        src="CMSIS/RTOS/RTX/SRC/IAR"/>
      </files>
    </component>

    <!-- START: Infineon Standard Peripherals Low Level Drivers (XMClib)-->

    <component Cclass="Device" Cgroup="XMClib" Csub="VADC" Cversion="2.1.24" condition="XMC4 CMSIS SCU">
      <description>Versatile Analog-to-Digital Converter (VADC) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_VADC
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___v_a_d_c.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_vadc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="CAN" Cversion="2.1.24" condition="XMC4 CMSIS SCU">
      <description>Controller area network (CAN) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_CAN
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___c_a_n.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_can.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="XMClib" Csub="CCU4" Cversion="2.1.24" condition="XMC4 CMSIS SCU">
      <description>Capture Compare Unit 4 (CCU4) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_CCU4
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___c_c_u4.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_ccu4.c"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="XMClib" Csub="CCU8" Cversion="2.1.24" condition="XMC4 CMSIS SCU">
      <description>Capture Compare Unit 8 (CCU8) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_CCU8
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___c_c_u8.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_ccu8.c"/>
      </files>
    </component>  

    <component Cclass="Device" Cgroup="XMClib" Csub="DAC" Cversion="2.1.24" condition="XMC4 CMSIS SCU">
      <description>Digital to Analog Converter (DAC) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_DAC
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___d_a_c.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_dac.c"/>
      </files>
    </component> 
        
