mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <component Cclass="Device" Cgroup="XMClib" Csub="WDT" Cversion="2.1.24" condition="XMC4 CMSIS SCU">
      <description> Watchdog Timer (WDT) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_WDT
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___w_d_t.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_wdt.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="FCE" Cversion="2.1.24" condition="XMC4 CMSIS SCU">
      <description> Flexible CRC Engine (FCE) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_FCE
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___f_c_e.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc_fce.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="FLASH" Cversion="2.1.24" condition="XMC4 CMSIS SCU">
      <description> Flash Driver (FLASH) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_FLASH
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___f_l_a_s_h.html"/>
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source" name="Device/XMClib/src/xmc_common.c"/>
        <file category="source" name="Device/XMClib/src/xmc4_flash.c"/>
      </files>
    </component>                              
    
    <!-- END: Infineon Standard Peripherals Low Level Drivers -->

    <!-- START: CMSIS Peripherals Drivers -->
        
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.01" Cversion="2.12" condition="XMC4 CMSIS Driver Ethernet MAC">
      <description>Ethernet MAC Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_ETH_MAC
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/ETH_MAC.c"/>        
      </files>
    </component>
    
    <component Cclass="CMSIS Driver" Cgroup="Ethernet PHY" Csub="KSZ8031" Capiversion="2.00" Cversion="1.01" condition="XMC4 CMSIS">
      <!-- short component description -->
      <description>Ethernet PHY KSZ8031 Driver</description>
      <RTE_Components_h>
        #define RTE_Drivers_PHY_KSZ8031        /* Driver PHY KSZ8031 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/ETH_PHY_KSZ8031.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="Ethernet PHY" Csub="KSZ8081" Capiversion="2.00" Cversion="1.01" condition="XMC4 CMSIS">
      <!-- short component description -->
      <description>Ethernet PHY KSZ8081 Driver</description>
      <RTE_Components_h>
        #define RTE_Drivers_PHY_KSZ8081        /* Driver PHY KSZ8081 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/ETH_PHY_KSZ8081.c"/>
      </files>
    </component>
    
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="USB" Capiversion="2.01" Cversion="2.07" condition="XMC4 CMSIS Driver USBD">
      <description>USB Device Driver for the XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="USB" Capiversion="2.01" Cversion="1.02" condition="XMC4 CMSIS Driver USBH">
      <description>USB Host Driver for the XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBH.c"/>
      </files>
    </component>
    
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.02" Cversion="2.08" condition="XMC4 CMSIS Driver I2C">
      <description>I2C Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_I2C                
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/I2C.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.01" Cversion="2.10" condition="XMC4 CMSIS Driver SPI">
      <description>SPI Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_SPI
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SPI.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.01" Cversion="2.12" condition="XMC4 CMSIS Driver USART">
      <description>USART Driver for XMC4000 Family</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART              
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/UART.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.00" Cversion="1.02" condition="XMC4 CMSIS Driver SAI">
      <description>SAI Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_SAI
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SAI.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="CAN" Capiversion="1.00" Cversion="1.03" condition="XMC4 CMSIS Driver CAN">
      <description>CAN Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_CAN
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/CAN.c"/>
      </files>
    </component>   

    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.02" Cversion="1.01" condition="XMC4 CMSIS Driver MCI">
      <description>MCI Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_MCI
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI.c"/>
      </files>
    </component>   
    
    <!-- END: CMSIS Peripherals Drivers -->

    <!-- Board Support Pack (BSP) for XMC4200 Application Kit -->   
    <bundle Cbundle="XMC4200 Application Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC4200 Application Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_CPU_Board_XMC4200_Actuator_R1 0.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4200 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4200 Application Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4200 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4200 Application Kit/Common/Buttons.c"/>
        </files>
      </component>    
    </bundle>

    <!-- Board Support Pack (BSP) for XMC4300 Relax Kit -->   
    <bundle Cbundle="XMC4300 Relax Kit" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4300 Relax Kit Board Support</description>    
      <doc>Documents/Infineon-User_Manual_XMC4300_Relax_Kit.pdf-UM-v01_01-EN.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4300 Relax Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4300 Relax Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4300 Relax Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4300 Relax Kit/Common/Buttons.c"/>
        </files>
      </component>    
    </bundle>

