mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <!-- Board Support Pack (BSP) for XMC4400 Application Kit -->   
    <bundle Cbundle="XMC4400 Application Kit" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4400 Application Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_CPU_Board_XMC4400_General_Purpose_R1 0.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4400 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4400 Application Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL SCU GPIO ERU">
        <description>Button driver for XMC4400 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4400 Application Kit/Common/Buttons.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" condition="XMC4 HAL VADC">
        <description>A/D Converter interface for XMC4400 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4400 Application Kit/Common/ADC.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Cvariant="SPI IF" condition="XMC4 CMSIS Driver SPI">
        <description>emWin LCD SPI Interface for XMC4400 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4400 Application Kit/Common/LCD_X.c"/>
          <file category="source" name="Boards/Infineon/XMC4400 Application Kit/Common/LCDConf.c"/>
        </files>
      </component>       
    </bundle>

    <!-- Board Support Pack (BSP) for XMC4500 Application Kit -->   
    <bundle Cbundle="XMC4500 Application Kit" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4500 Application Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_CPU_Board_XMC4500_General_Purpose_(CPU_45A-V3)_R1.0.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4500 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Application Kit/Common/LED_CPU45ApplicationKit.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4500 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Application Kit/Common/Buttons_CPU45ApplicationKit.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" condition="XMC4 HAL VADC">
        <description>A/D Converter interface for XMC4500 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Application Kit/Common/ADC.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Cvariant="SPI IF" condition="XMC4 CMSIS Driver SPI">
        <description>emWin LCD SPI Interface for XMC4500 Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Application Kit/Common/LCD_X.c"/>
          <file category="source" name="Boards/Infineon/XMC4500 Application Kit/Common/LCDConf.c"/>
        </files>
      </component>       
    </bundle>

    <!-- Board Support Pack (BSP) for XMC4500 SDRAM Application Kit -->   
    <bundle Cbundle="XMC4500 SDRAM Application Kit" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4500 SDRAM Application Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_CPU_Board_XMC4500_SDRAM_R1_0.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4500 SDRAM Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 SDRAM Application Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4500 SDRAM Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 SDRAM Application Kit/Common/Buttons.c"/>
        </files>
      </component>    
      <component Cgroup="emWin LCD" Cvariant="SPI IF" condition="XMC4 CMSIS Driver SPI">
        <description>emWin LCD SPI Interface for XMC4500 SDRAM Application Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 SDRAM Application Kit/Common/LCD_X.c"/>
          <file category="source" name="Boards/Infineon/XMC4500 SDRAM Application Kit/Common/LCDConf.c"/>
        </files>
      </component>       
    </bundle>

    <!-- Board Support Pack (BSP) for XMC4500 Relax Kit -->   
    <bundle Cbundle="XMC4500 Relax Kit" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4500 Relax Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_XMC4500_Relax_Kit-V1_R1.2.pdf</doc>
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4500 Relax Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Relax Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4500 Relax Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Relax Kit/Common/Buttons.c"/>
        </files>
      </component>    
    </bundle>

    <bundle Cbundle="XMC4500 Relax Lite Kit" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4500 Relax Lite Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_XMC4500_Relax_Kit-V1_R1.2.pdf</doc>    
      <component Cgroup="A/D Converter" condition="XMC4 HAL VADC">
        <description>A/D Converter interface for XMC4500 Relax Lite Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Relax Lite Kit/Common/ADC_XMC4500.c"/>
        </files>
      </component>       
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4500 Relax Lite Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Relax Lite Kit/Common/LED_XMC4500.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4500 Relax Lite Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4500 Relax Lite Kit/Common/Buttons_XMC4500.c"/>
        </files>
      </component>     
    </bundle>
    
    <!-- Board Support Pack (BSP) for XMC4700 Relax Kit -->   
    <bundle Cbundle="XMC4700 Relax Kit" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4700 Relax Kit Board Support</description>    
      <doc>Documents/Infineon-Board_User_Manual_XMC4700_XMC4800_Relax_Kit_Series-UM-v01_02-EN.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4700 Relax Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4700 Relax Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4700 Relax Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4700 Relax Kit/Common/Buttons.c"/>
        </files>
      </component>    
    </bundle>

