mdhardenburgh/Blinky/Packages/.cache/Infineon.XMC4000_DFP.2.13.0.pdsc
    <!-- Board Support Pack (BSP) for XMC4800 Relax Kit -->   
    <bundle Cbundle="XMC4800 Relax Kit" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4800 Relax Kit Board Support</description>    
      <doc>Documents/Infineon-Board_User_Manual_XMC4700_XMC4800_Relax_Kit_Series-UM-v01_02-EN.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4800 Relax Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4800 Relax Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4800 Relax Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4800 Relax Kit/Common/Buttons.c"/>
        </files>
      </component>    
    </bundle>

    <!-- Board Support Pack (BSP) for XMC4800 Automation Board Kit -->   
    <bundle Cbundle="XMC4800 Automation Board" Cclass="Board Support" Cversion="1.0.1">
      <description>XMC4800 Automation Board Support</description>    
      <doc>Documents/Infineon-XMC4800_Automation_Board-V2-UM-v01_00-EN.pdf</doc>    
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4800 Automation Board Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC4800 Automation Board/Common/LED.c"/>
        </files>
      </component>                        
    </bundle>
    
  </components>
</package>
